# Recommender Systems

In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
movie_titles = pd.read_csv('movies.csv')

In [4]:
movie_titles.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [5]:
movie_titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [6]:
df = pd.read_csv('ratings.csv')

In [7]:
df.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [8]:
df = pd.merge(df, movie_titles, on='movieId')

In [9]:
df.head()

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,5,1,4.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,7,1,4.5,1106635946,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
3,15,1,2.5,1510577970,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
4,17,1,4.5,1305696483,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy

In [10]:
tags = pd.read_csv('tags.csv')

In [11]:
tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [12]:
df = pd.merge(df, tags, on='movieId')

In [13]:
df.head()

,userId_x,movieId,rating,timestamp_x,title,genres,userId_y,tag,timestamp_y
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336,pixar,1139045764
1,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474,pixar,1137206825
2,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,567,fun,1525286013
3,5,1,4.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336,pixar,1139045764
4,5,1,4.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474,pixar,1137206825

In [14]:
import matplotlib.pyplot as plt
import seaborn as sns

In [15]:
%matplotlib inline

In [16]:
sns.set_style('white')

In [17]:
df.groupby('title')['rating'].mean()

title
(500) Days of Summer (2009)          3.666667
...And Justice for All (1979)        3.166667
10 Cloverfield Lane (2016)           3.678571
10 Things I Hate About You (1999)    3.527778
101 Dalmatians (1996)                3.074468
                                       ...
Zero Dark Thirty (2012)              4.107143
Zombieland (2009)                    3.877358
Zoolander (2001)                     3.509259
Zulu (1964)                          4.000000
eXistenZ (1999)                      3.863636
Name: rating, Length: 1554, dtype: float64

In [19]:
df.groupby('title')['rating'].mean().sort_values(ascending=False).head()

title
Come and See (Idi i smotri) (1985)     5.0
Lady Jane (1986)                       5.0
Woman Under the Influence, A (1974)    5.0
Into the Woods (1991)                  5.0
Two Family House (2000)                5.0
Name: rating, dtype: float64

In [21]:
df.groupby('title')['rating'].count().sort_values(ascending=False).head()

title
Pulp Fiction (1994)                                               55567
Fight Club (1999)                                                 11772
Star Wars: Episode IV - A New Hope (1977)                          6526
Léon: The Professional (a.k.a. The Professional) (Léon) (1994)     4655
2001: A Space Odyssey (1968)                                       4469
Name: rating, dtype: int64

In [22]:
df.head()

,userId_x,movieId,rating,timestamp_x,title,genres,userId_y,tag,timestamp_y
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336,pixar,1139045764
1,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474,pixar,1137206825
2,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,567,fun,1525286013
3,5,1,4.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,336,pixar,1139045764
4,5,1,4.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy,474,pixar,1137206825

In [23]:
ratings = pd.DataFrame(df.groupby('title')['rating'].mean())

In [24]:
ratings.head()

                                     rating
title
(500) Days of Summer (2009)        3.666667
...And Justice for All (1979)      3.166667
10 Cloverfield Lane (2016)         3.678571
10 Things I Hate About You (1999)  3.527778
101 Dalmatians (1996)              3.074468

In [25]:
df.groupby('title')['rating'].count()

title
(500) Days of Summer (2009)          336
...And Justice for All (1979)          3
10 Cloverfield Lane (2016)            28
10 Things I Hate About You (1999)     54
101 Dalmatians (1996)                 94
                                    ...
Zero Dark Thirty (2012)               70
Zombieland (2009)                    318
Zoolander (2001)                     324
Zulu (1964)                            4
eXistenZ (1999)                       22
Name: rating, Length: 1554, dtype: int64

In [26]:
df.groupby('title')['rating'].count().sort_values()

title
Personal Velocity (2002)                                              1
Double Life, A (1947)                                                 1
Shadow of the Thin Man (1941)                                         1
Dream for an Insomniac (1996)                                         1
Losin' It (1983)                                                      1
                                                                  ...
2001: A Space Odyssey (1968)                                       4469
Léon: The Professional (a.k.a. The Professional) (Léon) (1994)     4655
Star Wars: Episode IV - A New Hope (1977)                          6526
Fight Club (1999)                                                 11772
Pulp Fiction (1994)                                               55567
Name: rating, Length: 1554, dtype: int64

In [27]:
ratings['num of ratings'] = pd.DataFrame(df.groupby('title')['rating'].count())

In [28]:
ratings.head()

                                     rating  num of ratings
title
(500) Days of Summer (2009)        3.666667             336
...And Justice for All (1979)      3.166667               3
10 Cloverfield Lane (2016)         3.678571              28
10 Things I Hate About You (1999)  3.527778              54
101 Dalmatians (1996)              3.074468              94